{"ratings":"I love this restaurant and have visited a few time including my graduation day with my family. The first time we went was by accident but visited many times afterwards and loved it every time !Thank you for your lovely review Lotti4321, looking forward to seeing you very soon! Robb and the team at FFFxBeing a vegetarian I am very selective about the places I eat in, but Food For Friends must be one of the best in Brighton. I started going to it when it was a self-service cafe, and have always enjoyed eating there. There is a...MoreHello hendrik92, thank you so much for taking the time and leaving a review. I have passed on your lovely comments to the rest of the team. Next time you are in just ask your waiter to drop the blinds, (we do have them they're...MoreThis is a great restaurant. We visit Brighton regularly and would highly recommend Food for Friends. We are not vegetarians in our family but would definitely go out of our way to visit this place.\nThe decor is really nice, food is delicious, varied and...MoreHello Paula H, it was great reading your lovely comments. Please do come and see us when you're next in Brighton.\nWarmest Regards Robb and the team at FFFxThe menu is varied and all sounded very tempting - even for confirmed carnivores! And it exceeded our expectations. Delicious artisan breads and perfect triple cooked chips with a wonderfully tangy aioli. Children enjoyed their pizzas and adults more than pleased, especially with the portobello...MoreThank you for your lovely review Nicole M. Carnivores are always the ones we want to impress so Im glad to hear you enjoyed, I love the Gin Jam too! Im sorry to hear you waited for your mains, we do always like to serve...MoreFirst time actually visiting a vegetarian restaurant and what an experience. The food and drinks were incredible. We had the sharing platter bet four of us and opted for the veggie burger for main with the cinnamon poached pear for dessert. Food and service both...MoreSo lovely reading your comments Stenkenbaum, we love our burger and are very proud of our sharing platter so glad to hear they were enjoyed. I have to say the poached pear is one of my favourite desserts too, we will look forward to welcoming...MoreLike many veggies we've been here on and off for decades. We went at lunchtime and were near the door which was open and rather breezy to be honest. We ordered and then had rather a wait. My veggie burger was really tasty and well...MoreThank you for your feedback, we like to think we are very competitive with our prices when it comes to the high quality of ingredients we use in our home cooked dishes and our usually flawless service. Im sorry to hear you had to wait...MoreWithout a doubt this is one of the best restaurants in Brighton - especially for vegetarians and vegans, but also for meat-eaters too! The food is always absolutely amazing, and service is always good. It's a bit pricey but for the quality of the food,...MoreWe had dinner here last week during a short stay in Brighton. Excellent, interesting food and attentive service. The restaurant was full when we tried on Monday so probably worth booking a table first.Took my veggie sister here when she was in Brighton for a day trip. I'm not veggie, but thoroughly enjoyed the different tastes and textures provided by the platter and the cocktails were something else.😁 The staff were very attentive. My sister was completely blown...MoreIm very glad to read your review BrightonWendz! You must come back and try our new dessert cocktails that we are launching this week, we will see you very soon over a Martini or two!\nRobb and the team at FFFxFollowing our disappointing visit reviewed here in January, when I sent an inedible course back for the first time ever, I was heartened to learn that another new head chef had recently taken over the reigns in the kitchen and found that the menu had...MoreHello Darryl, once again as a business can we take this opportunity to apologise for this isolated incident. It seems we just don't seem to have much luck getting it right for you, as per two years ago when you claimed that our website gave...More"}